export default {

  data() {
    return {
      menu: [{
        id: 1,
        label: "Освещение",
        nodes: [
          {
          id: 2,
          label: "Датчик движения",
        },
          {
            id: 3,
            label: "Умная лампа",
          },
          {
            id: 4,
            label: "Умный выключатель лампа",
          }
        ],
      },
        {
          id: 5,
          label: "Водоснабжение",
          nodes: [
            {
              id: 6,
              label: "Датчик света",
            },
            {
              id: 7,
              label: "Умная лампа",
            },
            {
              id: 8,
              label: "Умный выключатель лампа",
            }
          ],
        },
        {
          id: 13,
          label: "Отопление",
        },
        {
          id: 14,
          label: "Мультимедиа",
        },
        {
          id: 15,
          label: "Безопасность",
        },
        {
          id: 16,
          label: "Техника",
        },
        {
          id: 17,
          label: "Контроллеры",
        }
      ]
    }
  },
}